<?php defined ('OACI') || exit ('此檔案不允許讀取。');

/**
 * @author      OA Wu <comdan66@gmail.com>
 * @copyright   Copyright (c) 2013 - 2018, OACI
 * @license     http://opensource.org/licenses/MIT  MIT License
 * @link        https://www.ioa.tw/
 */

return array (
  'UP14' => array (+14, '(UTC +14:00) 萊恩群島'),
  'UM12' => array (-12, '(UTC -12:00) 貝克/豪蘭島'),
  'UM11' => array (-11, '(UTC -11:00) 薩摩亞時區、紐埃'),
  'UM10' => array (-10, '(UTC -10:00) 夏威夷留申標準時間、庫克群島、塔希提島'),
  'UM95' => array (-9.5, '(UTC -9:30) 馬克薩斯群島'),
  'UM9' => array (-9, '(UTC -9:00) 阿拉斯加標準時間、甘比爾群島'),
  'UM8' => array (-8, '(UTC -8:00) 太平洋標準時間、 克利珀頓島'),
  'UM7' => array (-7, '(UTC -7:00) 山區標準時間'),
  'UM6' => array (-6, '(UTC -6:00) 中部標準時間'),
  'UM5' => array (-5, '(UTC -5:00) 東部標準時間、西加勒比標準時間'),
  'UM45' => array (-4.5, '(UTC -4:30) 委內瑞拉標準時間'),
  'UM4' => array (-4, '(UTC -4:00) 大西洋標準時間、東加勒比標準時間'),
  'UM35' => array (-3.5, '(UTC -3:30) 紐芬蘭標準時間'),
  'UM3' => array (-3, '(UTC -3:00) 阿根廷、巴西、法屬圭亞那、烏拉圭'),
  'UM2' => array (-2, '(UTC -2:00) 南喬治亞/南桑威奇群島'),
  'UM1' => array (-1, '(UTC -1:00) 亞速爾群島、佛得角群島'),
  'UTC' => array (0, '(UTC) 格林威治標準時間、西歐'),
  'UP1' => array (+1, '(UTC +1:00) 中歐、西非'),
  'UP2' => array (+2, '(UTC +2:00) 中部非洲、東歐、加里寧格勒'),
  'UP3' => array (+3, '(UTC +3:00) 莫斯科、東非'),
  'UP35' => array (+3.5, '(UTC +3:30) 伊朗標準時間'),
  'UP4' => array (+4, '(UTC +4:00) 阿塞拜疆標準時間、薩馬拉'),
  'UP45' => array (+4.5, '(UTC +4:30) 阿富汗'),
  'UP5' => array (+5, '(UTC +5:00) 巴基斯坦標準時間、葉卡捷琳堡'),
  'UP55' => array (+5.5, '(UTC +5:30) 印度標準時間、斯里蘭卡'),
  'UP575' => array (+5.75, '(UTC +5:45) 尼泊爾'),
  'UP6' => array (+6, '(UTC +6:00) 孟加拉國標準時間、不丹、鄂木斯克'),
  'UP65' => array (+6.5, '(UTC +6:30) 科科斯群島、緬甸'),
  'UP7' => array (+7, '(UTC +7:00) 克拉斯諾亞爾斯克、柬埔寨、老撾、泰國、越南'),
  'UP8' => array (+8, '(UTC +8:00) 澳大利亞西部標準時間、台北、北京、伊爾庫茨克'),
  'UP875' => array (+8.75, '(UTC +8:45) 澳大利亞中部西部標準時間'),
  'UP9' => array (+9, '(UTC +9:00) 日本標準時間、韓國標準時間、雅庫茨克時間'),
  'UP95' => array (+9.5, '(UTC +9:30) 澳大利亞中部標準時間'),
  'UP10' => array (+10, '(UTC +10:00) 澳大利亞東部標準時間、符拉迪沃斯托克'),
  'UP105' => array (+10.5, '(UTC +10:30) 豪勳爵島'),
  'UP11' => array (+11, '(UTC +11:00) 馬加丹、所羅門群島、瓦努阿圖'),
  'UP115' => array (+11.5, '(UTC +11:30) 諾福克島'),
  'UP12' => array (+12, '(UTC +12:00) 斐濟、吉爾伯特群島、堪察加半島、新西蘭標準時間'),
  'UP1275' => array (+12.75, '(UTC +12:45) 查塔姆群島標準時間'),
  'UP13' => array (+13, '(UTC +13:00) 菲尼克斯群島、湯加'),
);